#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/rds_migrations]
module.buckets.aws_s3_bucket_object.db_sample_function_object: Refreshing state... [id=dbSampleHandler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=nvs11fvmla]
module.network.aws_eip.public_eip: Refreshing state... [id=eipalloc-03cc7b21f9d50b165]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/minimal_lambda_function]
module.vpc.aws_vpc.kpinetworks_vpc: Refreshing state... [id=vpc-027821fac01f33b20]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=helloWorldHandler.zip]
module.policy.aws_iam_policy.lambda_network: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function]
module.policy.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_exec]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.policy.aws_iam_role.codebuild_role: Refreshing state... [id=codebuild_exec_role]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/a4e221ed-cf7e-4577-9bd5-82b763f10c60]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=32ye4t]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-nvs11fvmla-32ye4t-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=lambda_exec-20210928115941399100000001]
module.policy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=lambda_exec-20210927225016507100000001]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=minimal_lambda_function]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__da7bc1e8816c2abadef831cba7da9077.api.kpinetwork.com._CNAME]
module.vpc.aws_security_group.kpinetworks_group_lambda: Refreshing state... [id=sg-030a494008864a4ba]
module.vpc.aws_subnet.private_subnet_b: Refreshing state... [id=subnet-0e21f08e0f80d630c]
module.vpc.aws_subnet.private_subnet_a: Refreshing state... [id=subnet-0e9f879fe6565c455]
module.network.aws_internet_gateway.igw_kpinetworks: Refreshing state... [id=igw-0365a893d3d414bac]
module.vpc.aws_subnet.public_subnet_a: Refreshing state... [id=subnet-05ac82d4b6214f157]
module.vpc.aws_security_group.kpinetworks_group: Refreshing state... [id=sg-07aff3becbbd8b55e]
module.vpc.aws_security_group.kpinetworks_group_codebuild: Refreshing state... [id=sg-01c01a8ca3651b664]
module.policy.aws_iam_role_policy.codebuild_role_policy: Refreshing state... [id=codebuild_exec_role:terraform-20210928104330645100000001]
module.sql.aws_db_subnet_group.kpinetworks: Refreshing state... [id=kpinetworks]
module.functions.aws_lambda_function.db_sample_lambda_function: Refreshing state... [id=db_sample_lambda_function]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-09-28 21:55:25.167 +0000 UTC]
module.network.aws_nat_gateway.nat_kpinetworks: Refreshing state... [id=nat-0da10a4d974eaa110]
module.network.aws_route_table.kpinetworks_rt_public: Refreshing state... [id=rtb-0a639f7f427b6ebf0]
module.network.aws_route_table.kpinetworks_rt_private: Refreshing state... [id=rtb-0615d62a0e3c17023]
module.network.aws_route_table_association.public_a_subnet: Refreshing state... [id=rtbassoc-077dc26b0b20d2772]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-nvs11fvmla-32ye4t-GET]
module.network.aws_route_table_association.private_a_subnet: Refreshing state... [id=rtbassoc-0c7cc987ef85f1964]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.kpinetwork.com]
module.network.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=dfe8ck]
module.sql.aws_db_instance.kpinetworks_db: Refreshing state... [id=kpinetworksdb]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.kpinetwork.com_A]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.kpinetwork.com/]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/rds_migrations]
module.codebuild.aws_codebuild_webhook.rds_migrations: Refreshing state... [id=rds_migrations]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.network.aws_route_table.kpinetworks_rt_private has been changed
  ~ resource "aws_route_table" "kpinetworks_rt_private" {
        id               = "rtb-0615d62a0e3c17023"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0da10a4d974eaa110"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "nat-0da10a4d974eaa110"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ]
        tags             = {}
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.db_sample_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "db_sample_function_object" {
      ~ etag               = "f54bbec11f91cf63d422c3df57568239" -> "117c5f171352aa90d7888193ba3bba84"
        id                 = "dbSampleHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "a53bb1859e3514066448991bb5cb04b0" -> "7c573a2a8ad8c1fa836e166941c4d14a"
        id                 = "helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.db_sample_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "db_sample_lambda_function" {
        id                             = "db_sample_lambda_function"
      ~ last_modified                  = "2021-09-28T22:15:02.980+0000" -> (known after apply)
      ~ source_code_hash               = "UdYgwEKJHBJJVwYc30d+WwDu51G/1Y+7RP6ZwCjN25I=" -> "PU7ISGTxkrnnzAKpRUpjqARgCO4rnBJy6+sx6Xww6vk="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "minimal_lambda_function"
      ~ last_modified                  = "2021-09-28T22:15:02.983+0000" -> (known after apply)
      ~ source_code_hash               = "t/wNT+pPgFLdnU6WQjoH4hzOIC+OTTpXNwApeyOBgZI=" -> "ktMjo5MLe6TNxwLInx3VAx99d57V2FpGTaLw6KNocao="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2021-09-28T22:15:01Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:nvs11fvmla/prod" -> (known after apply)
      ~ id                = "dfe8ck" -> (known after apply)
      ~ invoke_url        = "https://nvs11fvmla.execute-api.us-west-2.amazonaws.com/prod" -> (known after apply)
      ~ stage_description = "Deployed at 2021-09-28T22:14:59Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_route_table.kpinetworks_rt_private will be updated in-place
  ~ resource "aws_route_table" "kpinetworks_rt_private" {
        id               = "rtb-0615d62a0e3c17023"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0da10a4d974eaa110"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0da10a4d974eaa110"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {}
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ridouku, Action: `pull_request`*